n5/src/Documents/PaymentOrder/PaymentOrder.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>PaymentOrder</name>
  <basedOn>Document.PayEmployees</basedOn>
  <basedOn>Document.PayAdvances</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Account</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>BankAccount</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>Base</name>
    <type>
      <types>DocumentRef.PayEmployees</types>
    </type>
  </attributes>
  <attributes>
    <name>CashFlow</name>
    <type>
      <types>CatalogRef.CashFlows</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Contract</name>
    <type>
      <types>CatalogRef.Contracts</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim1</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim2</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim3</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>Division</name>
    <type>
      <types>CatalogRef.Divisions</types>
    </type>
  </attributes>
  <attributes>
    <name>ExcludeTaxes</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ID</name>
    <type>
      <types>DefinedType.PaymentOrderNumber</types>
    </type>
  </attributes>
  <attributes>
    <name>IncomeTax</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>IncomeTaxRate</name>
    <type>
      <types>DefinedType.Percent</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Paid</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PaidBy</name>
    <type>
      <types>DefinedType.Payments</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentContent</name>
    <type>
      <types>DefinedType.PaymentContent</types>
    </type>
  </attributes>
  <attributes>
    <name>Recipient</name>
    <type>
      <types>CatalogRef.Organizations</types>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>RecipientBankAccount</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>RecipientPresentation</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Salary</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Taxes</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ToCompany</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Unload</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Urgent</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>VAT</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>VATRate</name>
    <type>
      <types>CatalogRef.VAT</types>
    </type>
  </attributes>
</mdclass:Document>

n5/src/Documents/PaymentOrder/Forms/List/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	init ();
	readAppearance ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure readAppearance ()
	
	rules = new Array ();
	rules.Add ( "
	|BankAccount show empty ( BankAccountFilter );
	|Recipient show empty ( RecipientFilter );
	|" );
	Appearance.Read ( ThisObject, rules );
	
EndProcedure

&AtServer
Procedure init ()
	
	BankAccountFilter = Logins.Settings ( "Company.BankAccount" ).CompanyBankAccount;
	filterByBankAccount ();

EndProcedure

&AtServer
Procedure filterByBankAccount ()

	DC.ChangeFilter ( List, "BankAccount", BankAccountFilter, not BankAccountFilter.IsEmpty () );
	Appearance.Apply ( ThisObject, "BankAccountFilter" );

EndProcedure

&AtClient
Procedure NotificationProcessing ( EventName, Parameter, Source )

	if ( EventName = Enum.MessageBankingAppUnloaded () ) then
		Items.List.Refresh ();
	endif;

EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure BankAccountFilterOnChange ( Item )
	
	filterByBankAccount ();
	
EndProcedure

&AtClient
Procedure RecipientFilterOnChange ( Item )
	
	filterByRecipient ();
	
EndProcedure

&AtServer
Procedure filterByRecipient ()

	DC.ChangeFilter ( List, "Recipient", RecipientFilter, not RecipientFilter.IsEmpty () );
	Appearance.Apply ( ThisObject, "RecipientFilter" );

EndProcedure

&AtClient
Procedure UnloadPayments ( Command )
	
	OpenForm ( "DataProcessor.UnloadPayments.Form" );

EndProcedure

&AtClient
Procedure TaxesOnlyOnChange ( Item )
	
	filterByTaxes ();

EndProcedure

&AtClient
Procedure filterByTaxes ()
	
	DC.ChangeFilter ( List, "Taxes", TaxesOnly, TaxesOnly );

EndProcedure
